In [2]:
# Data Analysis with Python _ 파이썬을 이용한 데이터 분석
# 1. sequence data type
# 2. Numpy, Pandas, Matplotlib
# 3. Statistics (통계학)

In [3]:
# pandas module설치

!pip install pandas

Requirement already satisfied: pandas in c:\developer\python39\lib\site-packages (1.3.0)
Requirement already satisfied: numpy>=1.17.3 in c:\developer\python39\lib\site-packages (from pandas) (1.21.0)
Requirement already satisfied: pytz>=2017.3 in c:\developer\python39\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\developer\python39\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\developer\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

WARNING: You are using pip version 21.1.3; however, version 21.2.1 is available.
You should consider upgrading via the 'c:\developer\python39\python.exe -m pip install --upgrade pip' command.

In [5]:
import pandas as pd
s = pd.Series([1,9,-3,4])
print(s)

print(s.values)
print(s.index)
print(s.dtypes)

0    1
1    9
2   -3
3    4
dtype: int64
[ 1  9 -3  4]
RangeIndex(start=0, stop=4, step=1)
int64

In [9]:
s = pd.Series(([1,9,-3,4]), index = ['a', 'b', 'c', 'd'])
print(s)

a    1
b    9
c   -3
d    4
dtype: int64

In [11]:
# 사전과 호환
dic = { 'a':1000,'b':2000,'c':3000,'d':4000}
s = pd.Series(dic)
print(s)

a    1000
b    2000
c    3000
d    4000
dtype: int64

In [16]:
df = pd.DataFrame({'a':1.,
                   'b':'2021.05.06',
                  'c':[1,2,3,4],
                  'd':(5,6,7,8),
                  'e':0,
                  'f':'web'
                  })
print(df)

     a           b  c  d  e    f
0  1.0  2021.05.06  1  5  0  web
1  1.0  2021.05.06  2  6  0  web
2  1.0  2021.05.06  3  7  0  web
3  1.0  2021.05.06  4  8  0  web

In [19]:
# 인덱스 확인
# 행
print(df.index)
# 열
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [35]:
data = {'name':['a','b','c','d','e'],
        'year':[2021,2022,2023,2024,2025],
        'point':[3.2,4.2,5.5,6.1,2.5]}
df = pd.DataFrame(data)
print(df)

  name  year  point
0    a  2021    3.2
1    b  2022    4.2
2    c  2023    5.5
3    d  2024    6.1
4    e  2025    2.5

In [28]:
# #인덱싱(열)을 기준으로 데이터 추가 삭제 및 변경가능
#print(df[['y']])

In [29]:
 # 새로운 열 추가
# df['new'] = [1,2,3,4,5]
# print(df)

In [30]:
## 삭제
# del df['new']
# print(df)

In [34]:
# 인덱싱(행)을 기준으로 데이터 추가 및 삭제
data = {'name':['a','b','c','d','e'],
        'year':[2021,2022,2023,2024,2025],
        'point':[3.2,4.2,5.5,6.1,2.5]}
df = pd.DataFrame(data)
print(df)

  name  year  point
0    a  2021    3.2
1    b  2022    4.2
2    c  2023    5.5
3    d  2024    6.1
4    e  2025    2.5

In [48]:
# 새로운 행 추가
df.loc[5,:] = ['f',2000, 8.8]
print(df)

  name    year  point
0    a  2021.0    3.2
1    b  2022.0    4.2
2    c  2023.0    5.5
3    d  2024.0    6.1
4    e  2025.0    2.5
5    f  2000.0    8.8

In [39]:
# 범위선택
print(df[2:4])

  name  year  point
2    c  2023    5.5
3    d  2024    6.1

In [40]:
# 특정 열 검색
print(df.loc[1:3,'name'])

1    b
2    c
3    d
Name: name, dtype: object

In [49]:
# 데이터프레임 데이터분석 :  다양한 함수 제공
# sum 합계
# min,max 최소값, 최대값
# argmin,argmax 최소,최대값의 인덱스 반환
# mean 평균
# median 중위값
# std 표준편차(평균을중심으로 얼마나 퍼져있는지), 
# var 분산(평균으로부터 얼마나 떨어져있는지)
# count
# sort_values 정렬
# corr,cor 상관계수, 공분산
# unique 특정행,열에서 중복값제외한 유니크값 반환

In [50]:
print(df.sum(axis=1))

0    2024.2
1    2026.2
2    2028.5
3    2030.1
4    2027.5
5    2008.8
dtype: float64

C:\Users\user12\AppData\Local\Temp/ipykernel_5628/166068483.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.sum(axis=1))

In [51]:
print(df.sum(axis=0))

name      abcdef
year     12115.0
point       30.3
dtype: object

In [52]:
# 파일 불러오기
# pd.read_csv(파일이름)
# 파일 저장하기
# .to_csv('파일이름.csv')

In [53]:
df = pd.read_csv("cities.csv")
print(df)

       행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
0     서울특별시  51672400    4649442    4916548
1     부산광역시   9565990    1647291    1717067
2     대구광역시   2397646    1182380    1215266
3     인천광역시   2936367    1470544    1465823
4     광주광역시   1442647     713793     728854
5     대전광역시   1456107     726666     729441
6     울산광역시   1126369     578924     547445
7   세종특별자치시    362995     181328     181667
8       경기도  13500688    6795088    6705600
9       강원도   1535530     772949     762581
10     충청북도   1597503     810225     787278
11     충청남도   2117400    1082113    1035287
12     전라북도   1794345     892670     901675
13     전라남도   1840921     926398     914523
14     경상북도   2632401    1326844    1305557
15     경상남도   3325840    1674612    1651228
16  제주특별자치도    675293     338766     336527

In [58]:
df.to_csv("cities_new.csv")

In [59]:
#df.head() : 처음5개 데이터를 보여줌(숫자를 적으면 숫자만큼)
#df.tail() : 마지막5개 데이터를 보여줌

In [60]:
df.info() #정보확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   행정구역       17 non-null     object
 1    총인구수(명)   17 non-null     int64
 2    남자인구수(명)  17 non-null     int64
 3    여자인구수(명)  17 non-null     int64
dtypes: int64(3), object(1)
memory usage: 672.0+ bytes

In [61]:
df.shape
# 행과 열의 수를 빠르게 확인

(17, 4)

In [62]:
df.describe()
#describe(기술하다,서술하다)
# 통계학은 기술통계,추정통계가 있다
# 기술통계는 서술하는것
# 추정통계는 표본(전체를 반영할수있냐는 기준)을 정해서 추정하는것

            총인구수(명)      남자인구수(명)      여자인구수(명)
count  1.700000e+01  1.700000e+01  1.700000e+01
mean   5.881202e+06  1.515884e+06  1.523669e+06
std    1.227352e+07  1.680130e+06  1.697563e+06
min    3.629950e+05  1.813280e+05  1.816670e+05
25%    1.456107e+06  7.266660e+05  7.294410e+05
50%    1.840921e+06  9.263980e+05  9.145230e+05
75%    2.936367e+06  1.470544e+06  1.465823e+06
max    5.167240e+07  6.795088e+06  6.705600e+06

In [63]:
# 탐색적 데이터분석(EDA)
# 데이터분석을 하기에 앞서 데이터가 어떤것인지 탐색하는것

In [64]:
# 1. 타이타닉 데이터를 df 형태로 읽어오기.
# 2. df 출력
# 3. head(), tail(), info(), shape, describe 로 기본정보

In [65]:
dafe = pd.read_csv("titanic.csv")

print(dafe)

     Unnamed: 0  Survived  Pclass     Sex        Age     Fare Embarked  \
0             0         0       3    male  22.000000   7.2500        S
1             1         1       1  female  38.000000  71.2833        C
2             2         1       3  female  26.000000   7.9250        S
3             3         1       1  female  35.000000  53.1000        S
4             4         0       3    male  35.000000   8.0500        S
..          ...       ...     ...     ...        ...      ...      ...
886         886         0       2    male  27.000000  13.0000        S
887         887         1       1  female  19.000000  30.0000        S
888         888         0       3  female  29.699118  23.4500        S
889         889         1       1    male  26.000000  30.0000        C
890         890         0       3    male  32.000000   7.7500        Q

      Class  Adult_Male   Embarktown
0     Third        True  Southampton
1     First       False    Cherbourg
2     Third       False  Southampton
3     First       False  Southampton
4     Third        True  Southampton
..      ...         ...          ...
886  Second        True  Southampton
887   First       False  Southampton
888   Third       False  Southampton
889   First        True    Cherbourg
890   Third        True   Queenstown

[891 rows x 10 columns]

In [68]:
dafe.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
0,0,0,3,male,22.0,7.2500,S,Third,True,Southampton
1,1,1,1,female,38.0,71.2833,C,First,False,Cherbourg
2,2,1,3,female,26.0,7.9250,S,Third,False,Southampton
3,3,1,1,female,35.0,53.1000,S,First,False,Southampton
4,4,0,3,male,35.0,8.0500,S,Third,True,Southampton

In [69]:
dafe.tail()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
886,886,0,2,male,27.000000,13.00,S,Second,True,Southampton
887,887,1,1,female,19.000000,30.00,S,First,False,Southampton
888,888,0,3,female,29.699118,23.45,S,Third,False,Southampton
889,889,1,1,male,26.000000,30.00,C,First,True,Cherbourg
890,890,0,3,male,32.000000,7.75,Q,Third,True,Queenstown

In [73]:
dafe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  891 non-null    int64
 1   Survived    891 non-null    int64
 2   Pclass      891 non-null    int64
 3   Sex         891 non-null    object
 4   Age         891 non-null    float64
 5   Fare        891 non-null    float64
 6   Embarked    889 non-null    object
 7   Class       891 non-null    object
 8   Adult_Male  891 non-null    bool
 9   Embarktown  889 non-null    object
dtypes: bool(1), float64(2), int64(3), object(4)
memory usage: 63.6+ KB

In [71]:
dafe.shape

(891, 10)

In [72]:
dafe.describe()

       Unnamed: 0    Survived      Pclass         Age        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean   445.000000    0.383838    2.308642   29.699118   32.204208
std    257.353842    0.486592    0.836071   13.002015   49.693429
min      0.000000    0.000000    1.000000    0.420000    0.000000
25%    222.500000    0.000000    2.000000   22.000000    7.910400
50%    445.000000    0.000000    3.000000   29.699118   14.454200
75%    667.500000    1.000000    3.000000   35.000000   31.000000
max    890.000000    1.000000    3.000000   80.000000  512.329200

In [75]:
# 데이터가져오고
# 탐색해보고
# 분석방향설정
# 데이터클리닝(정제)